# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd 
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
s1 = pd.Series(np.random.randint(1,4,100,dtype='l'))
s2 = pd.Series(np.random.randint(1,3,100,dtype='l'))
s3 = pd.Series(np.random.randint(10000,30000,100,dtype='l'))
print(s1,s2,s3)

0     2
1     2
2     2
3     3
4     1
     ..
95    1
96    2
97    1
98    2
99    1
Length: 100, dtype: int32 0     2
1     2
2     2
3     1
4     2
     ..
95    1
96    2
97    2
98    2
99    2
Length: 100, dtype: int32 0     22583
1     17326
2     11131
3     21792
4     17958
      ...
95    21709
96    29722
97    28248
98    20333
99    28099
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [4]:
df = pd.concat([s1,s2,s3], axis=1)
df

    0  1      2
0   2  2  22583
1   2  2  17326
2   2  2  11131
3   3  1  21792
4   1  2  17958
.. .. ..    ...
95  1  1  21709
96  2  2  29722
97  1  2  28248
98  2  2  20333
99  1  2  28099

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [6]:
df.rename(columns={0:'bedrs',1:'bathrs',2:'price_sqr_meter'}, inplace=True)
df

    bedrs  bathrs  price_sqr_meter
0       2       2            22583
1       2       2            17326
2       2       2            11131
3       3       1            21792
4       1       2            17958
..    ...     ...              ...
95      1       1            21709
96      2       2            29722
97      1       2            28248
98      2       2            20333
99      1       2            28099

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [7]:
bigcolumn = pd.concat([s1, s2, s3], axis=0)
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))
bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       2
1       2
2       2
3       3
4       1
..    ...
95  21709
96  29722
97  28248
98  20333
99  28099

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [8]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [10]:
bigcolumn.reset_index(drop=True,inplace=True)
bigcolumn

         0
0        2
1        2
2        2
3        3
4        1
..     ...
295  21709
296  29722
297  28248
298  20333
299  28099

[300 rows x 1 columns]